abandon
ability
abroad
absence
absolute
absorb
abstract
academic
accept
access
accident
account
accurate
achieve
acknowledge
acquire
active
adapt
adequate
adjust
admire
adult
advantage
adventure
affect
agency
agriculture
allow
alone
alternative
ambitious
analyze
ancient
anniversary
announce
anxiety
apartment
appear
appearance
approach
approve
area
argue
arrange
arrival
article
aspect
assess
assist
assume
attitude
authority
available
average
balance
benefit
bless
bond
borrow
brief
burden
calculate
capital
ceremony
challenge
channel
charge
chemical
choice
citizen
civil
claim
clerk
comfort
command
commerce
committee
common
community
compare
complex
concern
condition
conduct
confess
confidence
confiscate
conflict
connect
consequence
consider
constant
consult
contact
contain
content
contract
control
convert
court
creature
culture
curious
damage
danger
debate
debt
decade
decision
decline
degree
delay
delicate
demand
depend
describe
desert
deserve
design
desire
detail
determine
develop
device
direction
discover
discuss
disease
disguise
distance
distant
document
domestic
drop
duty
echo
education
effect
efficient
effort
element
emergency
emotion
employ
engine
environment
equal
escape
essential
evidence
exact
exchange
exhaust
exist
experience
expert
explain
explore
expression
factor
failure
faith
faithful
feature
financial
focus
foreign
forgive
formal
fortune
frequent
function
future
garden
general
generous
gentle
genuine
gold
government
gradual
grant
grateful
growth
habit
handle
harmony
health
heir
history
honor
human
identify
identity
ignore
imagine
impact
improve
include
increase
individual
industry
influence
inform
inspect
instance
instrument
interest
international
invisible
involve
jewel
journey
judge
justice
knowledge
labor
language
law
lead
legal
letter
limit
local
lonely
loss
loyal
maintain
major
massive
material
measure
memory
mercy
method
minor
modest
narrow
nation
natural
necessary
notice
object
observe
obtain
occasion
operation
opinion
opportunity
ordinary
organize
particular
patient
peace
penalty
percent
period
personal
persuade
physical
pilot
planet
poison
policy
portrait
position
possess
possible
practice
precious
prefer
prepare
present
pressure
prevent
pride
principle
process
produce
progress
project
promise
proper
property
protect
prove
provide
purchase
purpose
quality
quarrel
reaction
realize
reason
recent
recognize
record
recover
reduce
refer
refuse
region
regret
regular
relation
release
remain
repair
represent
request
require
research
resolve
respect
responsible
restore
result
return
revenge
reward
ridiculous
ring
risk
root
routine
rumor
sacrifice
schedule
science
search
secret
section
secure
select
sentence
serious
serve
shame
shelter
signal
silent
silver
similar
sincere
situation
society
solution
source
special
standard
statement
strict
structure
subject
sudden
supply
support
surface
system
tame
technology
temporary
theory
therefore
thirst
threat
token
traffic
transport
unique
university
urgent
vain
value
various
victory
wealth
wisdom
wonder
worth
